ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32U5xx/stm32u595xx.h
/****************  Bit definition for OCTOSPI_WIR register  *******************/
#define OCTOSPI_WIR_INSTRUCTION_Pos         XSPI_WIR_INSTRUCTION_Pos
#define OCTOSPI_WIR_INSTRUCTION_Msk         XSPI_WIR_INSTRUCTION_Msk                      /*!< 0xFFFFFFFF */
#define OCTOSPI_WIR_INSTRUCTION             XSPI_WIR_INSTRUCTION                          /*!< Instruction */

/****************  Bit definition for OCTOSPI_WABR register  ******************/
#define OCTOSPI_WABR_ALTERNATE_Pos          XSPI_WABR_ALTERNATE_Pos
#define OCTOSPI_WABR_ALTERNATE_Msk          XSPI_WABR_ALTERNATE_Msk                       /*!< 0xFFFFFFFF */
#define OCTOSPI_WABR_ALTERNATE              XSPI_WABR_ALTERNATE                           /*!< Alternate Bytes */

/****************  Bit definition for OCTOSPI_HLCR register  ******************/
#define OCTOSPI_HLCR_LM_Pos                 XSPI_HLCR_LM_Pos
#define OCTOSPI_HLCR_LM_Msk                 XSPI_HLCR_LM_Msk                              /*!< 0x00000001 */
#define OCTOSPI_HLCR_LM                     XSPI_HLCR_LM                                  /*!< Latency Mode */
#define OCTOSPI_HLCR_WZL_Pos                XSPI_HLCR_WZL_Pos
#define OCTOSPI_HLCR_WZL_Msk                XSPI_HLCR_WZL_Msk                             /*!< 0x00000002 */
#define OCTOSPI_HLCR_WZL                    XSPI_HLCR_WZL                                 /*!< Write Zero Latency */
#define OCTOSPI_HLCR_TACC_Pos               XSPI_HLCR_TACC_Pos
#define OCTOSPI_HLCR_TACC_Msk               XSPI_HLCR_TACC_Msk                            /*!< 0x0000FF00 */
#define OCTOSPI_HLCR_TACC                   XSPI_HLCR_TACC                                /*!< Access Time */
#define OCTOSPI_HLCR_TRWR_Pos               XSPI_HLCR_TRWR_Pos
#define OCTOSPI_HLCR_TRWR_Msk               XSPI_HLCR_TRWR_Msk                            /*!< 0x00FF0000 */
#define OCTOSPI_HLCR_TRWR                   XSPI_HLCR_TRWR                                /*!< Read Write Recovery Time */

/******************************************************************************/
/*                                                                            */
/*                            Hexadeca-SPI (HSPI)                             */
/*                                                                            */
/******************************************************************************/
/************* Bit definition for HSPI_CR register  ***************************/
#define HSPI_CR_EN_Pos                   XSPI_CR_EN_Pos
#define HSPI_CR_EN_Msk                   XSPI_CR_EN_Msk                                   /*!< 0x00000001 */
#define HSPI_CR_EN                       XSPI_CR_EN                                       /*!< Enable */
#define HSPI_CR_ABORT_Pos                XSPI_CR_ABORT_Pos
#define HSPI_CR_ABORT_Msk                XSPI_CR_ABORT_Msk                                /*!< 0x00000002 */
#define HSPI_CR_ABORT                    XSPI_CR_ABORT                                    /*!< Abort request */
#define HSPI_CR_DMAEN_Pos                XSPI_CR_DMAEN_Pos
#define HSPI_CR_DMAEN_Msk                XSPI_CR_DMAEN_Msk                                /*!< 0x00000004 */
#define HSPI_CR_DMAEN                    XSPI_CR_DMAEN                                    /*!< DMA Enable */
#define HSPI_CR_TCEN_Pos                 XSPI_CR_TCEN_Pos
#define HSPI_CR_TCEN_Msk                 XSPI_CR_TCEN_Msk                                 /*!< 0x00000008 */
#define HSPI_CR_TCEN                     XSPI_CR_TCEN                                     /*!< Timeout Counter Enable */
#define HSPI_CR_DMM_Pos                  XSPI_CR_DMM_Pos
#define HSPI_CR_DMM_Msk                  XSPI_CR_DMM_Msk                                  /*!< 0x00000040 */
#define HSPI_CR_DMM                      XSPI_CR_DMM                                      /*!< Dual Memory Mode */
#define HSPI_CR_FTHRES_Pos               XSPI_CR_FTHRES_Pos
#define HSPI_CR_FTHRES_Msk               XSPI_CR_FTHRES_Msk                               /*!< 0x00003F00 */
#define HSPI_CR_FTHRES                   XSPI_CR_FTHRES                                   /*!< FIFO Threshold Level*/
#define HSPI_CR_TEIE_Pos                 XSPI_CR_TEIE_Pos
#define HSPI_CR_TEIE_Msk                 XSPI_CR_TEIE_Msk                                 /*!< 0x00010000 */
#define HSPI_CR_TEIE                     XSPI_CR_TEIE                                     /*!< Transfer Error Interrupt Enable */
#define HSPI_CR_TCIE_Pos                 XSPI_CR_TCIE_Pos
#define HSPI_CR_TCIE_Msk                 XSPI_CR_TCIE_Msk                                 /*!< 0x00020000 */
#define HSPI_CR_TCIE                     XSPI_CR_TCIE                                     /*!< Transfer Complete Interrupt Enable */
#define HSPI_CR_FTIE_Pos                 XSPI_CR_FTIE_Pos
#define HSPI_CR_FTIE_Msk                 XSPI_CR_FTIE_Msk                                 /*!< 0x00040000 */
#define HSPI_CR_FTIE                     XSPI_CR_FTIE                                     /*!< FIFO Threshold Interrupt Enable */
#define HSPI_CR_SMIE_Pos                 XSPI_CR_SMIE_Pos
#define HSPI_CR_SMIE_Msk                 XSPI_CR_SMIE_Msk                                 /*!< 0x00080000 */
#define HSPI_CR_SMIE                     XSPI_CR_SMIE                                     /*!< Status Match Interrupt Enable */
#define HSPI_CR_TOIE_Pos                 XSPI_CR_TOIE_Pos
#define HSPI_CR_TOIE_Msk                 XSPI_CR_TOIE_Msk                                 /*!< 0x00100000 */
#define HSPI_CR_TOIE                     XSPI_CR_TOIE                                     /*!< TimeOut Interrupt Enable */
#define HSPI_CR_APMS_Pos                 XSPI_CR_APMS_Pos
#define HSPI_CR_APMS_Msk                 XSPI_CR_APMS_Msk                                 /*!< 0x00400000 */
#define HSPI_CR_APMS                     XSPI_CR_APMS                                     /*!< Automatic Poll Mode Stop */
#define HSPI_CR_PMM_Pos                  XSPI_CR_PMM_Pos
#define HSPI_CR_PMM_Msk                  XSPI_CR_PMM_Msk                                  /*!< 0x00800000 */
#define HSPI_CR_PMM                      XSPI_CR_PMM                                      /*!< Polling Match Mode */
#define HSPI_CR_FMODE_Pos                XSPI_CR_FMODE_Pos
#define HSPI_CR_FMODE_Msk                XSPI_CR_FMODE_Msk                                /*!< 0x30000000 */
#define HSPI_CR_FMODE                    XSPI_CR_FMODE                                    /*!< Functional Mode */
#define HSPI_CR_FMODE_0                  XSPI_CR_FMODE_0                                  /*!< 0x10000000 */
#define HSPI_CR_FMODE_1                  XSPI_CR_FMODE_1                                  /*!< 0x20000000 */
#define HSPI_CR_MSEL_Pos                 XSPI_HSPI_CR_MSEL_Pos
#define HSPI_CR_MSEL_Msk                 XSPI_HSPI_CR_MSEL_Msk                            /*!< 0xC0000000 */
#define HSPI_CR_MSEL                     XSPI_HSPI_CR_MSEL                                /*!< Memory Select */
#define HSPI_CR_MSEL_0                   XSPI_HSPI_CR_MSEL_0                              /*!< 0x40000000 */
#define HSPI_CR_MSEL_1                   XSPI_HSPI_CR_MSEL_1                              /*!< 0x80000000 */

/************* Bit definition for HSPI_DCR1 register  *************************/
#define HSPI_DCR1_CKMODE_Pos             XSPI_DCR1_CKMODE_Pos
#define HSPI_DCR1_CKMODE_Msk             XSPI_DCR1_CKMODE_Msk                             /*!< 0x00000001 */
#define HSPI_DCR1_CKMODE                 XSPI_DCR1_CKMODE                                 /*!< Mode 0 / Mode 3 */
#define HSPI_DCR1_FRCK_Pos               XSPI_DCR1_FRCK_Pos
#define HSPI_DCR1_FRCK_Msk               XSPI_DCR1_FRCK_Msk                               /*!< 0x00000002 */
#define HSPI_DCR1_FRCK                   XSPI_DCR1_FRCK                                   /*!< Free Running Clock */
#define HSPI_DCR1_CSHT_Pos               XSPI_DCR1_CSHT_Pos
#define HSPI_DCR1_CSHT_Msk               XSPI_DCR1_CSHT_Msk                               /*!< 0x00003F00 */
#define HSPI_DCR1_CSHT                   XSPI_DCR1_CSHT                                   /*!< Chip Select High Time */
#define HSPI_DCR1_DEVSIZE_Pos            XSPI_DCR1_DEVSIZE_Pos
#define HSPI_DCR1_DEVSIZE_Msk            XSPI_DCR1_DEVSIZE_Msk                            /*!< 0x001F0000 */
#define HSPI_DCR1_DEVSIZE                XSPI_DCR1_DEVSIZE                                /*!< Device Size */
#define HSPI_DCR1_MTYP_Pos               XSPI_DCR1_MTYP_Pos
#define HSPI_DCR1_MTYP_Msk               XSPI_DCR1_MTYP_Msk                               /*!< 0x07000000 */
#define HSPI_DCR1_MTYP                   XSPI_DCR1_MTYP                                   /*!< Memory Type */
#define HSPI_DCR1_MTYP_0                 XSPI_DCR1_MTYP_0                                 /*!< 0x01000000 */
#define HSPI_DCR1_MTYP_1                 XSPI_DCR1_MTYP_1                                 /*!< 0x02000000 */
#define HSPI_DCR1_MTYP_2                 XSPI_DCR1_MTYP_2                                 /*!< 0x04000000 */

/************* Bit definition for HSPI_DCR2 register  *************************/
#define HSPI_DCR2_PRESCALER_Pos          XSPI_DCR2_PRESCALER_Pos
#define HSPI_DCR2_PRESCALER_Msk          XSPI_DCR2_PRESCALER_Msk                          /*!< 0x000000FF */
#define HSPI_DCR2_PRESCALER              XSPI_DCR2_PRESCALER                              /*!< Clock prescaler */
#define HSPI_DCR2_WRAPSIZE_Pos           XSPI_DCR2_WRAPSIZE_Pos
#define HSPI_DCR2_WRAPSIZE_Msk           XSPI_DCR2_WRAPSIZE_Msk                           /*!< 0x00070000 */
#define HSPI_DCR2_WRAPSIZE               XSPI_DCR2_WRAPSIZE                               /*!< Wrap Size */
#define HSPI_DCR2_WRAPSIZE_0             XSPI_DCR2_WRAPSIZE_0                             /*!< 0x00010000 */
#define HSPI_DCR2_WRAPSIZE_1             XSPI_DCR2_WRAPSIZE_1                             /*!< 0x00020000 */
#define HSPI_DCR2_WRAPSIZE_2             XSPI_DCR2_WRAPSIZE_2                             /*!< 0x00040000 */

